brew "awscli"
brew "bat"
brew "fzf"
brew "git"
brew "hugo"
brew "neovim"
brew "ruff"
brew "tig"
brew "tmux"
brew "uv"
cask "claude-code"
cask "cursor"
cask "docker-desktop"
cask "font-fira-code"
cask "pycharm-ce"
cask "visual-studio-code"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
